The first part of any data science project is preparing your data, which means making sure its in the right place and format for you to conduct your analysis. The first step of any data preparation is importing your raw data and cleaning it.

In [68]:
import pandas as pd

In [69]:
df=pd.read_excel(r"C:\Users\educa\OneDrive\Documents\p\mexico_real_estate_1.xlsx")
df1=pd.read_excel(r"C:\Users\educa\OneDrive\Documents\p\mexico_real_estate_2.xlsx")
df2=pd.read_excel(r"C:\Users\educa\OneDrive\Documents\p\mexico_real_estate_3.xlsx")
print(df)
print(df1)
print(df2)

    property_type                            state        lat         lon  \
0           house                 Estado de México  19.560181  -99.233528
1           house                       Nuevo León  25.688436 -100.198807
2       apartment                         Guerrero  16.767704  -99.764383
3       apartment                         Guerrero  16.829782  -99.911012
4           house  Veracruz de Ignacio de la Llave        NaN         NaN
..            ...                              ...        ...         ...
695         house                          Morelos        NaN         NaN
696         house                          Yucatán  21.050653  -89.558841
697         house                          Yucatán  21.343796  -89.262060
698     apartment                       Nuevo León        NaN         NaN
699         house                        Querétaro  20.587378 -100.418361

     area_m2  price_usd
0        150   67965.56
1        186   63223.78
2         82   84298.37
3        150   94308.80
4        175   94835.67
..       ...        ...
695      310  237089.17
696      334  137017.34
697      130  110404.35
698      155  184446.42
699      106   56637.97

[700 rows x 6 columns]
    property_type             state        lat         lon  area_m2  price_mxn
0       apartment        Nuevo León  25.721081 -100.345581       72    1300000
1       apartment            Puebla        NaN         NaN      190    2500000
2           house           Morelos  23.634501 -102.552788      360    5300000
3           house           Morelos        NaN         NaN       76     820000
4           house            Puebla        NaN         NaN      200    1100000
..            ...               ...        ...         ...      ...        ...
695         house           Morelos  18.917542  -98.963181      140    1450000
696         house  Distrito Federal  19.472128  -99.146697      190    1943000
697         house  Estado de México  19.234984  -99.558175      115    2100000
698         house            Puebla  18.918714  -98.426639       90     890000
699         house           Yucatán  21.075163  -89.516731      185    1695000

[700 rows x 6 columns]
    property_type                            place_with_parent_names  \
0       apartment  |México|Distrito Federal|Gustavo A. Madero|Acu...
1           house           |México|Estado de México|Toluca|Metepec|
2           house  |México|Estado de México|Toluca|Toluca de Lerd...
3           house        |México|Morelos|Temixco|Burgos Bugambilias|
4       apartment  |México|Veracruz de Ignacio de la Llave|Veracruz|
..            ...                                                ...
695         house  |México|Jalisco|Tlajomulco de Zúñiga|Tlajomulc...
696         house                          |México|Morelos|Jiutepec|
697         house                            |México|Yucatán|Mérida|
698         house           |México|San Luis Potosí|San Luis Potosí|
699         house           |México|Estado de México|Toluca|Metepec|

                          lat-lon  area_m2  price_usd
0             19.52589,-99.151703       71   48550.59
1          19.2640539,-99.5727534      233  168636.73
2            19.268629,-99.671722      300   86932.69
3                             NaN      275  263432.41
4            19.511938,-96.871956       84   68508.67
..                            ...      ...        ...
695         20.532264,-103.484418      175  121178.91
696        18.9289862,-99.1802147      100   47417.83
697  21.0284038368,-89.6530058049       81   39524.23
698   22.11830417,-101.0321938992      360  245050.24
699          19.233201,-99.558519      115  110667.85

[700 rows x 5 columns]

## Clean `df1`

 Inspect `df1` by looking at its [`shape`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.shape.html) attribute. Then use the [`info`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.info.htm) method to see the data types and number of missing values for each column. Finally, use the [`head`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.head.html) method to determine to look at the first five rows of your dataset.

In [70]:
df.shape

(700, 6)

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 32.9+ KB

In [72]:
df.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,67965.56
1,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,apartment,Guerrero,16.829782,-99.911012,150,94308.80
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,94835.67

It looks like there are a couple of problems in this DataFrame that we need to solve. First, there are many rows with `NaN` values in the `"lat"` and `"lon"` columns. Second, the data type for the `"price_usd"` column is `object` when it should be `float`.

In [73]:
# remove rows with missing values
df.dropna(inplace=True)
# transform price_usd from object to float
df['price_usd']=(
    df['price_usd']
    .astype(str)
    .str.replace("$",""  , regex=False)
    .str.replace(",","")
    .astype(float)
)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.9+ KB

## Clean `df2`

Now it's time to tackle df2. Take a moment to inspect it using the same commands you used before. You'll notice that it has the same issue of NaN values, but there's a new problem, too: The home prices are in Mexican pesos ("price_mxn"), not US dollars ("price_usd"). If we want to compare all the home prices in this dataset, they all need to be in the same currency

In [74]:
df1.shape

(700, 6)

In [75]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

In [76]:
df1.head()

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo León  25.721081 -100.345581       72    1300000
1     apartment      Puebla        NaN         NaN      190    2500000
2         house     Morelos  23.634501 -102.552788      360    5300000
3         house     Morelos        NaN         NaN       76     820000
4         house      Puebla        NaN         NaN      200    1100000

In [77]:
# removing missing values
df1.dropna(inplace=True)
# converting price in mexican into dolars 
df1['price_usd']=(df1['price_mxn']/19).round(2)
# removing price_mxn column in the data Frame
df1.drop(columns=['price_mxn'],inplace=True)
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 571 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  571 non-null    object
 1   state          571 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        571 non-null    int64
 5   price_usd      571 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.2+ KB

## Clean `df3`

Use the same shape, info and head commands to inspect the df2. Do you see any familiar issues?

You'll notice that we still have NaN values, but there are two new problems:

Instead of separate "lat" and "lon" columns, there's a single "lat-lon" column.
Instead of a "state" column, there's a "place_with_parent_names" column.
We need the resolve these problems so that df2 has the same columns in the same format as df and df1.

In [78]:
df2.shape

(700, 5)

In [79]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    int64
 4   price_usd                700 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.5+ KB

In [80]:
df2.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275,263432.41
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67

In [86]:
# let's remove the column with the missing values 
df2.dropna(inplace=True)
# let's split the column lat-lon in two different column 
df2[["lat","lon"]]=df2['lat-lon'].str.split(",",expand=True)
# let's remove column lat-lon
df2.drop(columns=['lat-lon'],inplace=True)
df2.head()

,property_type,area_m2,price_usd,state,lat,lon
0,apartment,71,48550.59,Distrito Federal,19.52589,-99.151703
1,house,233,168636.73,Estado de México,19.2640539,-99.5727534
2,house,300,86932.69,Estado de México,19.268629,-99.671722
4,apartment,84,68508.67,Veracruz de Ignacio de la Llave,19.511938,-96.871956
5,house,175,102763.00,Jalisco,20.689157,-103.366728

In [92]:
# let's split the place with parents name into only state and remove that columns
#df2['state']=df2['place_with_parent_names'].str.split('|',expand=True)[2]
#df2.drop(columns=['place_with_parent_names'],inplace=True)

In [93]:
df2.head()

,property_type,area_m2,price_usd,state,lat,lon
0,apartment,71,48550.59,Distrito Federal,19.52589,-99.151703
1,house,233,168636.73,Estado de México,19.2640539,-99.5727534
2,house,300,86932.69,Estado de México,19.268629,-99.671722
4,apartment,84,68508.67,Veracruz de Ignacio de la Llave,19.511938,-96.871956
5,house,175,102763.00,Jalisco,20.689157,-103.366728

we  have three clean DataFrames, and now it's time to combine them into a single DataFrame so that you can conduct your analysis.

In [94]:
# let's concatanate Three DataFrame 
df3=pd.concat([df,df1,df2])
df3

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,67965.56
1,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,apartment,Guerrero,16.829782,-99.911012,150,94308.80
5,house,Yucatán,21.052583,-89.538639,205,105191.37
...,...,...,...,...,...,...
695,house,Jalisco,20.532264,-103.484418,175,121178.91
696,house,Morelos,18.9289862,-99.1802147,100,47417.83
697,house,Yucatán,21.0284038368,-89.6530058049,81,39524.23
698,house,San Luis Potosí,22.11830417,-101.0321938992,360,245050.24
699,house,Estado de México,19.233201,-99.558519,115,110667.85

In [95]:
df3.to_csv(r"C:\Users\educa\OneDrive\Documents\df3.csv", index=False)